In [2]:
import numpy as np 
import pandas as pd

In [ ]:
# df1 = pd.read_excel("../data/les-francais-et-l-information-arcom-2024-base-anonymisee.xlsx")
# df2 = pd.read_excel("../data/les-francais-et-l-information-arcom-2024-datamap.xlsx", sheet_name="TEXTS")

In [ ]:
# df1.head(5)

,RECORD,UUID,CIBLE,SOURCE_BASE_R1,POIDS03,INTER,CONTACT,RS1_R,RS2C_RECODE_AG_R,RS3_R,...,VA1_R2_7,VA1_R2_8,VA1_R2_9,NOU1_R,PP3_R,QUIZZ1_R,QUIZZ2_R,QUIZZ3_R,QUIZZ4_R,QUESTION_OUVERTE
0,NaN,NaN,NaN,1,"4,0000087157244",68964.0,NaN,1,6,6,...,NaN,NaN,NaN,7.0,1.0,4,2,2,4,NaN
1,NaN,NaN,NaN,1,"3,58505412001293",62701.0,NaN,2,6,6,...,NaN,NaN,NaN,6.0,15.0,1,2,2,3,NaN
2,NaN,NaN,NaN,1,"4,0000087157244",64008.0,NaN,2,7,6,...,NaN,NaN,NaN,1.0,6.0,1,3,1,1,NaN
3,NaN,NaN,NaN,1,"4,00000441186288",16039.0,NaN,1,4,1,...,NaN,NaN,NaN,6.0,14.0,4,1,2,4,NaN
4,NaN,NaN,NaN,1,"4,0000087157244",9961.0,NaN,2,7,6,...,NaN,NaN,NaN,6.0,1.0,1,1,1,1,NaN

In [ ]:
# df1.columns

Index(['RECORD', 'UUID', 'CIBLE', 'SOURCE_BASE_R1', 'POIDS03', 'INTER',
       'CONTACT', 'RS1_R', 'RS2C_RECODE_AG_R', 'RS3_R',
       ...
       'VA1_R2_7', 'VA1_R2_8', 'VA1_R2_9', 'NOU1_R', 'PP3_R', 'QUIZZ1_R',
       'QUIZZ2_R', 'QUIZZ3_R', 'QUIZZ4_R', 'QUESTION_OUVERTE'],
      dtype='object', length=1076)

In [ ]:
# df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3346 entries, 0 to 3345
Columns: 1076 entries, RECORD to QUESTION_OUVERTE
dtypes: float64(930), int64(143), object(3)
memory usage: 27.5+ MB

In [ ]:
#1. Chargement des fichiers
df1 = pd.read_excel("../test/small_base_anomyme.xlsx")
df2 = pd.read_excel("../test/small_datamap.xlsx")

# 2. Créer un dictionnaire de dictionnaires
# Exemple : mapping["RS1_R"] = {nan: 'RS1 Genre', 1.0: 'Un homme', 2.0: 'Une femme', 3.0: 'Non binaire'}
mapping = {
    cat: group.set_index("CODE")["FR:L"].to_dict()
    for cat, group in df2.groupby("NAME")
}

# 3. Remplacer automatiquement chaque colonne de df1
for col in df1.columns: # on ignore les première colonne
    if col in mapping:
        df1[col] = df1[col].apply(
            lambda x: mapping[col].get(x, x) if pd.notna(x) else x
        )

# 4. Sauvegarder le fichier final
df1.to_csv("small_final_3.csv", index=False)

print("✅ Fusion terminée ! Le fichier 'small_final_3.csv' contient les noms des produits.")

✅ Fusion terminée ! Le fichier 'small_final_3.csv' contient les noms des produits.

In [6]:
df3 = pd.read_csv("../notebooks/small_final_3.csv")
df3.head()

       RS1_R                                              RS3_R
0   Un homme                                         Retraité·e
1  Une femme                                         Retraité·e
2  Une femme                                         Retraité·e
3   Un homme  Actif, active (ayant un emploi, y compris en c...
4  Une femme                                         Retraité·e

In [10]:
df1.head()

       RS1_R                                              RS3_R
0   Un homme                                         Retraité·e
1  Une femme                                         Retraité·e
2  Une femme                                         Retraité·e
3   Un homme  Actif, active (ayant un emploi, y compris en c...
4  Une femme                                         Retraité·e